trade_exp/src/Documents/ЗаказНаДоставкуОтПоставщика/ЗаказНаДоставкуОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаДоставкуОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9108def1-74b6-49f6-826d-411b4f378a62">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf2dbe71-1e2e-44dd-8f86-3a17b80c2b50">
    <name>ПрибытиеНаВыгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="80353671-e282-4b56-8dce-2a57668ab838">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dfe24e2d-676b-48a5-a9b8-3c5f0b13acc6">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="455e72aa-afaf-45cd-9f49-31780b117de1">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88892e7e-ed4c-4ff9-9e78-07befff4e04a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a2e9879-cef7-42dd-905f-482b6a2f455a">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="86982b60-862a-4887-ba01-a08bc79f03c6">
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f108f560-b4a5-4574-bd00-9c07fe772f24">
    <name>СтоимостьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9430bac8-9a15-40d7-aa10-3adfdb59c859">
    <name>ТранзитФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fcf9d9ba-0906-4ffc-9e5e-737f64099517">
    <name>ПрибытиеНаПогрузку</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d780eac6-c9c8-4c2f-852c-10736a66bfd6">
    <name>ИнтервалНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2044c9b2-8129-4e36-9f45-71da4032cde7">
    <name>ВремяНаПогрузкеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="735e0970-9985-412c-a81f-2c90d6cb07d3">
    <name>МаксимальнаяДлина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7b12af0-6c5d-49b7-a923-925de351a6bf">
    <name>НаименованиеГруза</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0258e270-c945-45b7-9b29-400d7f52e81c">
    <name>ВремяНаВыгрузкеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb5d3130-09a9-492d-b99b-014e0a261c51">
    <name>ВремяНаПогрузкеПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0143b187-4422-4fe8-969a-7ba96e241605">
    <name>АдресНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f56e03a7-c4af-4ed3-b43a-e18714951dd2">
    <name>ТелефонНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="52d79523-9883-43fe-aed3-302fe7eb6ebe">
    <name>ИнтервалНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0375cd-d0c9-4885-97e6-dfa91b0458f7">
    <name>ВремяНаВыгрузкеПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fe254e26-2b30-4311-a001-839a5b565611">
    <name>КоличествоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c30b0ea6-027c-49fa-8637-dc11fd260b8c">
    <name>КонтрагентКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d40ac935-ba6c-4dfc-95dc-42dd2c509023">
    <name>ФилиалВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84a4d445-3c12-4ced-b011-00a1d0cc5f10">
    <name>АдресНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fe589a13-9652-4e80-a67c-daaecc2e76dc">
    <name>ТелефонНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="03649d03-61d7-4d00-aad8-b57d6b16b8cc">
    <name>СсылкаБитрикс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fb39d2e-07c5-4a8e-91cd-fbeecd9241ff">
    <name>Транзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec493491-1e4b-4c54-afa5-c6540c966861">
    <name>СтоимостьТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a47fe91-e454-4a30-948a-b860a45251f9">
    <name>НаправлениеДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7b68ea76-f8ba-4e00-a6e6-0bfa3d88a69d">
    <name>ДоверенностьНаСумму</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="331761b3-207b-4f40-b3a4-cfa35eae35cb">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3eeb0f84-a6a0-44ea-bc0e-3a7c773ae588">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf76a4e-cc67-4e12-871f-a782770ccfd1">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c16b4556-8131-40e1-b044-7e7acc8ab2d6">
    <name>КоличествоДнейНаВывозЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="481ac138-6530-4efd-abc8-d5cb7f871411">
    <name>ПоДокументу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="a848cef6-15c4-4d0f-8f9f-3ccb4cf548c2">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bae39f0f-a7b4-46fc-afc5-0fc2017cb0ee">
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ЗаказНаДоставкуОтПоставщика/Forms/СозданиеЗаявокНаДоставкуОтПоставщика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	АдресДокументыОснования = Параметры.ДокументыОснованияАдресХранилища;
	ДокументыОснования = ПолучитьИзВременногоХранилища(АдресДокументыОснования);
	Тр_Заказы.Очистить();
	ПроверкаДоступностиСозданияРейса(ДокументыОснования);
	
КонецПроцедуры

&НаКлиенте
Процедура Тр_СоздатьЗаявки(Команда)
	
	ОбязательныеПоляЗаполнены = (Тр_НазваниеЗаявки<>"" И Тр_ПрибытиеНаПогрузку<>'00010101' И Тр_СтоимостьДоставки<>0);
	Если Не Элементы.Тр_СтраницаЗаказов.ТолькоПросмотр И ОбязательныеПоляЗаполнены Тогда 
		Попытка
			СоздатьДокументыСервер();
			Элементы.Тр_Страницы.ТекущаяСтраница = Элементы.Тр_СтраницаЗаявок;
			Элементы.Тр_СтраницаЗаказов.ТолькоПросмотр = Истина;
			Элементы.НадписьКоличествоЗаявокИтог.Заголовок = "Создано заявок: " + Строка(Тр_Заявки.Количество());
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	ИначеЕсли Не ОбязательныеПоляЗаполнены Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поле обязательно для заполнения!";
		Сообщение.Поле = ?(Тр_НазваниеЗаявки="", "Тр_НазваниеЗаявки", ?(Тр_ПрибытиеНаПогрузку='00010101', "Тр_ПрибытиеНаПогрузку", ?(Тр_СтоимостьДоставки=0, "Тр_СтоимостьДоставки","")));
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыСервер()
	
	ДанныеОснования = Тр_Заказы.Выгрузить();
	
	//обработка тч
	//определение количества порций документов заказов
	//1 порция = 1 документ доставки
	//формирование выборки данных заполнения (которые заданы)
	
	//1ый вариант
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Заказ КАК Заказ,
		|	ТЗ.КоличествоМест КАК КоличествоМест,
		|	ТЗ.ТипУпаковки КАК ТипУпаковки
		|ПОМЕСТИТЬ втЗаказы
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаказы.Заказ КАК Заказ,
		|   втЗаказы.Грузополучатель Как Грузополучатель,
		|   втЗаказы.Грузоотправитель КАК Грузоотправитель,
		|	втЗаказы.КоличествоМест КАК КоличествоМест,
		|	втЗаказы.ТипУпаковки КАК ТипУпаковки,
		|	втЗаказы.СуммаДокумента
		|ИЗ
		|(ВЫБРАТЬ
		|	втЗаказы.Заказ КАК Заказ,
		|   втЗаказы.Заказ.Организация Как Организация,
		|   втЗаказы.Заказ.Склад КАК Грузополучатель,
		|   втЗаказы.Заказ.Партнер КАК Грузоотправитель,
		|	втЗаказы.КоличествоМест КАК КоличествоМест,
		|	втЗаказы.ТипУпаковки КАК ТипУпаковки,
		|   втЗаказы.Заказ.СуммаДокумента КАК СуммаДокумента
		|	ИЗ втЗаказы КАК втЗаказы
		|) КАК втЗаказы
		|
		|УПОРЯДОЧИТЬ ПО
		|	втЗаказы.Грузополучатель,
		|	втЗаказы.Грузоотправитель
		|ИТОГИ
		|	СУММА(КоличествоМест),
		|	СУММА(СуммаДокумента)
		|ПО
		|	ОБЩИЕ,
		|	втЗаказы.Грузополучатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаказы.Заказ КАК Заказ,
		|   втЗаказы.Грузополучатель Как Грузополучатель,
		|   втЗаказы.Грузоотправитель КАК Грузоотправитель,
		|	втЗаказы.КоличествоМест КАК КоличествоМест,
		|	втЗаказы.ТипУпаковки КАК ТипУпаковки,
		|	втЗаказы.СуммаДокумента
		|ИЗ
		|(ВЫБРАТЬ
		|	втЗаказы.Заказ КАК Заказ,
		|   втЗаказы.Заказ.Организация Как Организация,
		|   втЗаказы.Заказ.Склад КАК Грузополучатель,
		|   втЗаказы.Заказ.Партнер КАК Грузоотправитель,
		|	втЗаказы.КоличествоМест КАК КоличествоМест,
		|	втЗаказы.ТипУпаковки КАК ТипУпаковки,
		|   втЗаказы.Заказ.СуммаДокумента КАК СуммаДокумента
		|	ИЗ втЗаказы КАК втЗаказы
		|) КАК втЗаказы
		|
		|УПОРЯДОЧИТЬ ПО
		|	втЗаказы.Грузополучатель,
		|	втЗаказы.Грузоотправитель
		|ИТОГИ
		|	СУММА(КоличествоМест),
		|	СУММА(СуммаДокумента)
		|ПО
		|	ОБЩИЕ,
		|	втЗаказы.Грузополучатель";
	Запрос.УстановитьПараметр("ТЗ", ДанныеОснования);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИтог.Следующий() Цикл
		ВыборкаГрузополучатель = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Грузополучатель");
		Пока ВыборкаГрузополучатель.Следующий() Цикл
			ДокументДоставки = Документы.ЗаказНаДоставкуОтПоставщика.СоздатьДокумент();
			ВыборкаДетальныеЗаписи = ВыборкаГрузополучатель.Выбрать();
			ДокиОснования = Новый Массив;
			ТипУпаковки = "";
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				//заполнение по основанию, по данным
				ДокиОснования.Добавить(ВыборкаДетальныеЗаписи.Заказ);
				ТипУпаковки = ВыборкаДетальныеЗаписи.ТипУпаковки;
			КонецЦикла;
			Документы.ЗаказНаДоставкуОтПоставщика.ЗаполнитьДанныеПоОснованию(ДокиОснования, ДокументДоставки);
			ДокументДоставки.Дата = ТекущаяДата();
			ДокументДоставки.НаименованиеГруза = Тр_НазваниеЗаявки;
			ДокументДоставки.ПрибытиеНаПогрузку = Тр_ПрибытиеНаПогрузку;
			ДокументДоставки.КоличествоМест = ВыборкаГрузополучатель.КоличествоМест;
			ДокументДоставки.СтоимостьДоставки = Тр_СтоимостьДоставки*ВыборкаГрузополучатель.СуммаДокумента/ВыборкаИтог.СуммаДокумента; 
			ДокументДоставки.ТипУпаковки = ТипУпаковки;
			ДокументДоставки.Записать(РежимЗаписиДокумента.Проведение);
			Заявка = Тр_Заявки.Добавить();
			Заявка.Документ = ДокументДоставки.Ссылка;
		КонецЦикла;	
	КонецЦикла;

КонецПроцедуры 


&НаКлиенте
Процедура Тр_Открыть(Команда)
	
	Если Элементы.Тр_Страницы.ТекущаяСтраница = Элементы.Тр_СтраницаЗаявок Тогда
		Документ = Элементы.Тр_Заявки.ТекущиеДанные.Документ;
	Иначе
		Документ = Элементы.Тр_Заказы.ТекущиеДанные.Заказ;
	КонецЕсли;
	АльтерраОбщегоНазначенияКлиент.ОткрытьДокумент(Документ, ЭтаФорма); 
	
КонецПроцедуры

// Рейс можно создать только по заказам в статусах "Подтвержден" или "Согласован"
//	Параметры		
//		СписокЗаказов - список заказов, которые необходимо либо обновить, либо добавить в текущую таблицу
//
&НаСервере
Процедура ПроверкаДоступностиСозданияРейса(Знач СписокЗаказов)

	Если ТипЗнч(СписокЗаказов) <> Тип("Массив") Тогда
		Если ТипЗнч(СписокЗаказов) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Заказ = СписокЗаказов;
			СписокЗаказов = Новый Массив;
			СписокЗаказов.Добавить(Заказ);
		Иначе
			ТаблицаФормыЗаказов = СписокЗаказов;
			СписокЗаказов = ТаблицаФормыЗаказов.Выгрузить().ВыгрузитьКолонку("Заказ");
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщику.Ссылка КАК Заказ,
		|	ВЫБОР
		|		КОГДА ЗаказПоставщику.Статус В (&ДопустимыеСтатусы)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК МожноСоздатьРейс
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка В(&СписокЗаказов)";
	ДопустимыеСтатусы = Новый Массив;
	ДопустимыеСтатусы.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Согласован);
	ДопустимыеСтатусы.Добавить(Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
	Запрос.УстановитьПараметр("ДопустимыеСтатусы", ДопустимыеСтатусы);
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	РейсСоздатьНельзя = Ложь;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрЗаказа = Неопределено;
		Если Тр_Заказы.Количество() > 0 Тогда
			ОтборСтрокПоЗаказу = Новый Структура;
			ОтборСтрокПоЗаказу.Вставить("Заказ", ВыборкаДетальныеЗаписи.Заказ);
			НайденныеСтроки = Тр_Заказы.НайтиСтроки(ОтборСтрокПоЗаказу);
			
			Если НайденныеСтроки <> Неопределено И НайденныеСтроки.Количество()>0 Тогда
				СтрЗаказа = НайденныеСтроки[0];
			КонецЕсли;
		КонецЕсли;
		
		Если СтрЗаказа = Неопределено Тогда
			СтрЗаказа = Тр_Заказы.Добавить();
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(СтрЗаказа, ВыборкаДетальныеЗаписи);
		Если Не СтрЗаказа.МожноСоздатьРейс Тогда
			РейсСоздатьНельзя = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Тр_ЗаказыТр_СоздатьЗаявки.Видимость = Не РейсСоздатьНельзя;
	
	Если РейсСоздатьНельзя Тогда
		Сообщить("Выделенные заказы не согласованы, невозможно создать по ним рейс!", СтатусСообщения.Важное);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Тр_ЗаказыПослеУдаления(Элемент)
	ПроверкаДоступностиСозданияРейса(Тр_Заказы);
КонецПроцедуры

&НаКлиенте
Процедура Тр_ЗаказыПриИзменении(Элемент)
	
	ОчиститьСообщения();
	ТекущийЭлементТрЗаказов = Элементы.Тр_Заказы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущийЭлементТрЗаказов.Заказ) И Не  ЗначениеЗаполнено(ТекущийЭлементТрЗаказов.МожноСоздатьРейс) Тогда
		ПроверкаДоступностиСозданияРейса(ТекущийЭлементТрЗаказов.Заказ);
	КонецЕсли; 
	
КонецПроцедуры
